tap "argon/mas"
tap "microsoft/git"
tap "puma/puma"
tap "rcmdnk/file"
tap "sanemat/font"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "awscli"
brew "gettext", link: false
brew "fontconfig"
brew "glib"
brew "cairo"
brew "cask"
brew "deno"
brew "direnv"
brew "docker", link: false
brew "docker-compose"
brew "fd"
brew "harfbuzz"
brew "libtool"
brew "pango"
brew "fontforge"
brew "gcc"
brew "gd"
brew "gh"
brew "ghq"
brew "gibo"
brew "gist"
brew "git"
brew "pkgconf"
brew "gobject-introspection"
brew "hugo"
brew "imagemagick"
brew "jemalloc"
brew "jq"
brew "krb5"
brew "libffi"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "lua"
brew "luajit"
brew "mackup"
brew "mas"
brew "msgpack"
brew "mysql"
brew "neovim"
brew "nodenv"
brew "peco"
brew "perl"
brew "postgresql@14", restart_service: :changed
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "rename"
brew "ripgrep"
brew "spidermonkey"
brew "telnet"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh-completions"
brew "puma/puma/puma-dev"
brew "rcmdnk/file/brew-file"
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "appcleaner"
cask "arc"
cask "caldigit-docking-utility"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "clip-studio-paint"
cask "clipy"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-ricty-diminished"
cask "git-credential-manager"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "obs"
cask "obsidian"
cask "rectangle"
cask "rightfont"
cask "sequel-ace"
cask "slack"
cask "thebrowsercompany-dia"
cask "via"
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
vscode "3w36zj6.textlint"
vscode "bierner.emojisense"
vscode "cocopon.iceberg-theme"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "google.geminicodeassist"
vscode "hancel.markdown-image"
vscode "ics.japanese-proofreading"
vscode "karunamurti.haml"
vscode "kortina.vscode-markdown-notes"
vscode "mrmlnc.vscode-scss"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mushan.vscode-paste-image"
vscode "philipbe.theme-gray-matter"
vscode "romanpeshkov.vscode-text-tables"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tchayen.markdown-links"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
vscode "yzhang.markdown-all-in-one"
npm "corepack"
