tap "argon/mas"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "rcmdnk/file"
tap "sanemat/font"
brew "asciinema"
brew "autoconf"
brew "autoconf@2.13"
brew "automake"
brew "awscli"
brew "fontconfig"
brew "gettext", link: false
brew "glib"
brew "cairo"
brew "deno"
brew "direnv"
brew "docker", link: false
brew "docker-compose", link: false
brew "docker-machine"
brew "fd"
brew "harfbuzz"
brew "libtool"
brew "pango"
brew "fontforge"
brew "gcc"
brew "gd"
brew "gh"
brew "ghq"
brew "gibo"
brew "gist"
brew "git"
brew "pkg-config"
brew "gobject-introspection"
brew "hugo"
brew "imagemagick"
brew "jemalloc"
brew "krb5"
brew "libffi"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "lua"
brew "luajit"
brew "mackup"
brew "mas"
brew "msgpack"
brew "mysql"
brew "neovim"
brew "node"
brew "peco"
brew "perl"
brew "postgresql@12"
brew "postgresql@14", restart_service: true
brew "python@3.8"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "spidermonkey"
brew "telnet"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh-completions"
brew "puma/puma/puma-dev"
brew "rcmdnk/file/brew-file"
brew "sanemat/font/ricty"
cask "adobe-creative-cloud"
cask "appcleaner"
cask "blackhole-16ch"
cask "blackhole-2ch"
cask "clip-studio-paint"
cask "clipy"
cask "cmd-eikana"
cask "deepl"
cask "discord"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "hyperswitch"
cask "inkdrop"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "notion"
cask "obs"
cask "pushplaylabs-sidekick"
cask "sequel-ace"
cask "via"
cask "visual-studio-code"
cask "zoom"
mas "Bear", id: 1091189122
mas "CleanMyMac X", id: 1339170533
mas "Contrast", id: 1254981365
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RightFont", id: 1475782381
mas "Slack", id: 803453959
mas "Textwell", id: 905944937
mas "Xcode", id: 497799835
