tap "argon/mas"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "rcmdnk/file"
tap "sanemat/font"

brew "asciinema"
brew "autoconf"
brew "autoconf@2.13"
brew "automake"
brew "python@3.9"
brew "awscli"
brew "fontconfig"
brew "gettext", link: false
brew "libffi"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "direnv"
brew "docker", link: false
brew "docker-compose", link: false
brew "docker-machine"
brew "fd"
brew "gobject-introspection"
brew "harfbuzz"
brew "libtool"
brew "pango"
brew "fontforge"
brew "gcc"
brew "gcc@8"
brew "gd"
brew "gh"
brew "ghq"
brew "gibo"
brew "gist"
brew "git"
brew "python@3.8"
brew "hugo"
brew "jemalloc"
brew "krb5"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "lua"
brew "luajit"
brew "mackup"
brew "msgpack"
brew "mysql"
brew "neovim"
brew "node"
brew "peco"
brew "perl"
brew "postgresql", restart_service: true
brew "postgresql@12"
brew "python@2", link: false
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "rename"
brew "ruby"
brew "spidermonkey"
brew "telnet"
brew "tig"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh-completions"
brew "argon/mas/mas"
brew "puma/puma/puma-dev"
brew "rcmdnk/file/brew-file"
brew "sanemat/font/ricty"

cask "deepl"
cask "appcleaner"
cask "blackhole"
cask "dropbox"
cask "rightfont"
cask "sequel-ace"
cask "clipy"
cask "clip-studio-paint"
cask "zoom"
cask "visual-studio-code"
cask "figma"
cask "firefox"
cask "discord"
cask "iterm2"
cask "obs"

mas "CleanMyMac-MAS", id: 1339170533
mas "Contrast", id: 1254981365
mas "GIPHY CAPTURE", id: 668208984
mas "Grammarly for Safari", id: 1462114288
mas "LadioCast", id: 411213048
mas "LastPass", id: 926036361
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Murasaki", id: 430300762
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Textwell", id: 905944937
mas "Toggl Track", id: 957734279
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
